# PointOnPlane Members

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
PointOnPlane Members
PointOnPlane Class Methods Properties See Also
---
The PointOnPlane type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
| GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
| GetPlaneReference | The geometric plane reference. |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| IsValidPlaneReference | Check whether a geometry reference corresponds to a referenceable plane. |
| NewPointOnPlane | Construct a PointOnPlane given a reference and a location in space. |
| SetPlaneReference | Change the geometric plane reference. |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Offset | Signed offset from the plane. |
| Position | The coordinates of the point (or its projection) on the plane. |
| XVec | The X-coordinate vector of the point, in the plane's coordinate system. |

# See Also
PointOnPlane Class
Autodesk.Revit.DB Namespace